{ "negative" : [ {"title":"Duplicate Product in the brand of Lenovo.","review":"In the name of Lenovo brand this is a duplicate product. This is fooling of customer form Amazon.Just after couple of weeks, this product is useless. It takes hour n hours to get charged and after full charge also it hardly charge the mobile one time.This is just ridiculous and I am very much annoyed by it. I was out of station and now I can not return this product also having amazon's ten days policy. Amazon should refund\\accept return of this product.","rating":"1.0","score":-10,"comparative":-0.10416666666666667,"effective":-0.10416666666666667,"wordLength":4},{"title":"I hate this - useless : stopped working in 2 months.","review":"HiI purchased the Lenovo Power bank on 1st June 2015 : pretty expensive viz a viz other power banks. I started to make use of the same around October 2015 and it has stopped working.This is soooo depressing and dejection for Lenovo.I hate this product and suggest noone should ever buy this.Replacement also not possible.","rating":"1.0","score":-5,"comparative":-0.07352941176470588,"effective":-0.07352941176470588,"wordLength":4},{"title":"Power bank charging does not get completed.","review":"Even after keeping the power bank for charging for 24 hours, the charging does not end, and the fourth step light keeps blinking. So its not getting charged fully. I guess the inside batteries may be from old stock with expired life. May be the reason for heavy discount.Initiated return of the product.","rating":"1.0","score":-3,"comparative":-0.045454545454545456,"effective":-0.045454545454545456,"wordLength":1},{"title":"Lenovo Power Bank - Not getting charged ! Bad Experience !","review":"After unpacking Lenove Power Bank , I put the unit on charging . Even after 24 hours it doesn't get itself charged . Product failure or faulty unit that is Lenovo and supplier to decide. But for me it's  bad experience with Lenovo product . Hope they wil replace the faulty unit under warranty .","rating":"1.0","score":-6,"comparative":-0.08695652173913043,"effective":-0.08695652173913043,"wordLength":4},{"title":"Lost it, that's why I don't like it","review":"Lol. As far as getting the job done is concerned, this is a nice product and charges my phone at least twice before dying out. However, the casing is prone to visible scratches making it look ugly and dirty easily, if possible, get a different colour","rating":"1.0","score":-6,"comparative":-0.1016949152542373,"effective":-0.1016949152542373,"wordLength":7},{"title":"Waste of Money","review":"Don't go for this product... my galaxy note 3 having 3100 mah battery which is charged once & powerbank battery drain out in one charge eventhough it's fully charged... problem started exactly finishing 10 days return policy as per sellers terms.","rating":"1.0","score":-8,"comparative":-0.14814814814814814,"effective":-0.14814814814814814,"wordLength":3},{"title":"Horrible Quality- Never Buy","review":"This product couldn't even survive for a week and one of the USB port came out from board. I requested Amazon for the replacement before but they didnt initiate anything. Will never recommend anyone else to buy this ugly product.","rating":"1.0","score":-1,"comparative":-0.018867924528301886,"effective":-0.018867924528301886,"wordLength":2},{"title":"Feeling cheated by amazon by lenovo.","review":"Specification shows 10400 mh power bank whereas truth is that it can't charge my Samsung j8 once... Means power bank capacity is not capable enough to charge j8 once.. So don buy this power bank they are cheating us.","rating":"1.0","score":-4,"comparative":-0.07692307692307693,"effective":-0.07692307692307693,"wordLength":2},{"title":"Money waste","review":"Very bod quality. Need to charge 12 or 14 hours for full charge and i can charge my Lenovo K4 note only once.Money Waste !I want to return this.Having i year warranty. I want to return this item. Pls cooperate.","rating":"1.0","score":3,"comparative":0.05660377358490566,"effective":0.05660377358490566,"wordLength":4},{"title":"Fake Battery Capacity","review":"i don't like the battery capacity of this power bank, when i charged it full it will charge my phone approx one and half time, where my battery capacity is 3500 mAh, also the 1 charging port is not working.","rating":"2.0","score":-5,"comparative":-0.09433962264150944,"effective":-0.18867924528301888,"wordLength":2},{"title":"Pl do not buy","review":"Does not even complete a second charge for a 3000 maH battery phone.Takes long time to recharge itself and also while charging the phone.I had bought it because of the brand but I regret that.","rating":"1.0","score":-2,"comparative":-0.041666666666666664,"effective":-0.041666666666666664,"wordLength":1},{"title":"so its useless for me now","review":"i have purchased may.2016..its not working now.not able to find customer care number.service center is 150 KM far from where i lived..so its useless for me now...","rating":"1.0","score":0,"comparative":0,"effective":0,"wordLength":2},{"title":"Worst product","review":"Very Bad Power Bank . My Two laptop got damaged due to the same as be,coz I have connected the power bank to my laptop for charge the Power Bank. Worst product","rating":"1.0","score":-9,"comparative":-0.2,"effective":-0.2,"wordLength":3},{"title":"Four Stars","review":"bulky and brick like. rest it is as described.dead in 4 monthsdidnt charged twice even in first timedont buy guys not even if they offer money with it","rating":"1.0","score":-1,"comparative":-0.024390243902439025,"effective":-0.024390243902439025,"wordLength":2},{"title":"Ugly","review":"Ugly cheap plastic look. Fatter than its counterparts of the same price and performance.","rating":"2.0","score":-3,"comparative":-0.1111111111111111,"effective":-0.2222222222222222,"wordLength":1},{"title":"One Star","review":"Very poor quality only last for 2 hours I am very unhappy with the product","rating":"1.0","score":-2,"comparative":-0.07142857142857142,"effective":-0.07142857142857142,"wordLength":3}] }